In [1]:
import pandas as pd
pd.__version__

'2.3.0'

# Series

In [42]:
data = [10, 20, 40, 80, 100]
ser = pd.Series(data, index = ['s1', 's2', 's3', 's4', 's5'], name='NUMBERS')
ser

s1     10
s2     20
s3     40
s4     80
s5    100
Name: NUMBERS, dtype: int64

## indexing

In [43]:
ser[0], ser[1], ser['s3']

C:\Users\bvkir\AppData\Local\Temp\ipykernel_5360\1726416428.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser[1], ser['s3']

(np.int64(10), np.int64(20), np.int64(40))

## slicing

In [44]:
ser[1:3], ser[:'s4']

(s2    20
 s3    40
 Name: NUMBERS, dtype: int64,
 s1    10
 s2    20
 s3    40
 s4    80
 Name: NUMBERS, dtype: int64)

## Pandas Series â€“ Attributes and Methods
dtype: Return the dtype.

ndim: Return the Number of dimensions

size: Return the number of elements.

name: Return the name of the Series.

hasnans: Returns True if NaNs are in the series.

index: The index of the series

head(): Return the first n rows.

tail(): Return the last n rows.

info(): Display the Summary of the series

In [45]:
ser.dtype, ser.ndim, ser.size, ser.name, ser.hasnans, ser.index, ser.head(2), ser.info()

<class 'pandas.core.series.Series'>
Index: 5 entries, s1 to s5
Series name: NUMBERS
Non-Null Count  Dtype
--------------  -----
5 non-null      int64
dtypes: int64(1)
memory usage: 252.0+ bytes

(dtype('int64'),
 1,
 5,
 'NUMBERS',
 False,
 Index(['s1', 's2', 's3', 's4', 's5'], dtype='object'),
 s1    10
 s2    20
 Name: NUMBERS, dtype: int64,
 None)

## Combine

In [47]:
import pandas as pd
 
# Data to be stored in the Pandas Series
data1 = [10, 20, 40, 80, 100]
data2 = [25, 5, 75, 95, 45] 
 
# Create a Series using the Series() method
series1 = pd.Series(data1)
series2 = pd.Series(data2)
 
# Display the Series
print("Before combining the series:\n") 
print("Series1: \n",series1)
print("Series2: \n",series2)
 
def demo(x1, x2) :
  if (x1 > x2):
    return x1
  else:
    return x2
 
# Combine two series into one
# The function returns the largest value
res = series1.combine(series2, demo) 
  
# Display the result
print("\nAfter combining into one:\n",res)

Before combining the series:

Series1:
 0     10
1     20
2     40
3     80
4    100
dtype: int64
Series2:
 0    25
1     5
2    75
3    95
4    45
dtype: int64

After combining into one:
 0     25
1     20
2     75
3     95
4    100
dtype: int64

# DataFrame

In [2]:
data = {
  'student': ["Amit", "John", "Jacob", "David", "Steve"],
  'rank': [1, 4, 3, 5, 2],
  'marks': [95, 70, 80, 60, 90]
}
 
df = pd.DataFrame(data)
 
print("Student Records\n\n",df)

Student Records

   student  rank  marks
0    Amit     1     95
1    John     4     70
2   Jacob     3     80
3   David     5     60
4   Steve     2     90

## indexing

In [7]:
df = pd.DataFrame(data, index=['RowA', 'RowB', 'RowC', 'RowD', 'RowE'])
print(f'Student Records \n\n{df}')
# I want RowA, and Student
print(f'\n\nrowa student = {df.loc['RowA', 'student']}')
print(f'by using iloc = {df.iloc[0,0]}')

Student Records

     student  rank  marks
RowA    Amit     1     95
RowB    John     4     70
RowC   Jacob     3     80
RowD   David     5     60
RowE   Steve     2     90


rowa student = Amit
by using iloc = Amit

In [8]:
df = pd.DataFrame(data,  index=['Student1', 'Student2', 'Student3', 'Student4', 'Student5'],)
df

         student  rank  marks
Student1    Amit     1     95
Student2    John     4     70
Student3   Jacob     3     80
Student4   David     5     60
Student5   Steve     2     90

In [10]:
print("\nDisplaying the columns:")
for col in df:
   print(col)
df.columns

Displaying the columns:
student
rank
marks

Index(['student', 'rank', 'marks'], dtype='object')

## slicing

In [11]:
df

         student  rank  marks
Student1    Amit     1     95
Student2    John     4     70
Student3   Jacob     3     80
Student4   David     5     60
Student5   Steve     2     90

In [15]:
print(df.iloc[0:3, :], '\n', df.iloc[1, :2])

         student  rank  marks
Student1    Amit     1     95
Student2    John     4     70
Student3   Jacob     3     80
 student    John
rank          4
Name: Student2, dtype: object

In [20]:
df.loc['Student1':'Student2', 'student'], df.loc['Student1':'Student3', 'student':'rank']

(Student1    Amit
 Student2    John
 Name: student, dtype: object,
          student  rank
 Student1    Amit     1
 Student2    John     4
 Student3   Jacob     3)

## DataFrame â€“ Attributes and Methods
dtypes: Return the dtypes in the DataFrame

ndim: Return the number of dimensions of the DataFrame

size: Return the number of elements in the DataFrame.

shape: Return the dimensionality of the DataFrame in the form of a tuple.

index: Return the index of the DataFrame

T: Transpose the rows and columns

head(): Return the first n rows.

tail(): Return the last n rows.

In [25]:
df.dtypes, df.ndim, df.size, df.shape, df.index, df.columns, df.T, df.head(2), df.tail()

(student    object
 rank        int64
 marks       int64
 dtype: object,
 2,
 15,
 (5, 3),
 Index(['Student1', 'Student2', 'Student3', 'Student4', 'Student5'], dtype='object'),
 Index(['student', 'rank', 'marks'], dtype='object'),
         Student1 Student2 Student3 Student4 Student5
 student     Amit     John    Jacob    David    Steve
 rank           1        4        3        5        2
 marks         95       70       80       60       90,
          student  rank  marks
 Student1    Amit     1     95
 Student2    John     4     70,
          student  rank  marks
 Student1    Amit     1     95
 Student2    John     4     70
 Student3   Jacob     3     80
 Student4   David     5     60
 Student5   Steve     2     90)

## Join Pandas DataFrame

In [27]:
data1 = {
  'id': ["S01", "S02", "S03", "S04", "S05"],
  'student': ["Amit", "John", "Jacob", "David", "Steve"],
  'roll': [101, 102, 103, 104, 105]
}
data2 = {
  'rank': [1, 4, 3, 5, 2],
  'marks': [95, 70, 80, 60, 90]
}
df1 = pd.DataFrame(data1)
df2 = pd.DataFrame(data2)
df12 = df1.join(df2)
df21 = df2.join(df1)
print(f'df1 = \n{df1}')
print(f'df2 = \n{df2}')
print(f'df1 with df2 = \n{df12}')
print(f'df2 with df1 = \n{df21}')

df1 =
    id student  roll
0  S01    Amit   101
1  S02    John   102
2  S03   Jacob   103
3  S04   David   104
4  S05   Steve   105
df2 =
   rank  marks
0     1     95
1     4     70
2     3     80
3     5     60
4     2     90
df1 with df2 =
    id student  roll  rank  marks
0  S01    Amit   101     1     95
1  S02    John   102     4     70
2  S03   Jacob   103     3     80
3  S04   David   104     5     60
4  S05   Steve   105     2     90
df2 with df1 =
   rank  marks   id student  roll
0     1     95  S01    Amit   101
1     4     70  S02    John   102
2     3     80  S03   Jacob   103
3     5     60  S04   David   104
4     2     90  S05   Steve   105

### using concatenate

In [34]:
con_df12 = pd.concat([df1, df2], axis=1)
con_df21 = pd.concat([df2, df1], axis=1)
con_df12_row = pd.concat([df1, df2], axis=0)
con_df12, con_df21, con_df12_row

(    id student  roll  rank  marks
 0  S01    Amit   101     1     95
 1  S02    John   102     4     70
 2  S03   Jacob   103     3     80
 3  S04   David   104     5     60
 4  S05   Steve   105     2     90,
    rank  marks   id student  roll
 0     1     95  S01    Amit   101
 1     4     70  S02    John   102
 2     3     80  S03   Jacob   103
 3     5     60  S04   David   104
 4     2     90  S05   Steve   105,
     id student   roll  rank  marks
 0  S01    Amit  101.0   NaN    NaN
 1  S02    John  102.0   NaN    NaN
 2  S03   Jacob  103.0   NaN    NaN
 3  S04   David  104.0   NaN    NaN
 4  S05   Steve  105.0   NaN    NaN
 0  NaN     NaN    NaN   1.0   95.0
 1  NaN     NaN    NaN   4.0   70.0
 2  NaN     NaN    NaN   3.0   80.0
 3  NaN     NaN    NaN   5.0   60.0
 4  NaN     NaN    NaN   2.0   90.0)

In [30]:
df12

    id student  roll  rank  marks
0  S01    Amit   101     1     95
1  S02    John   102     4     70
2  S03   Jacob   103     3     80
3  S04   David   104     5     60
4  S05   Steve   105     2     90